#-------------------------------------------------------------------------------------------------------------------------------------------------
#задача №1
#-------------------------------------------------------------------------------------------------------------------------------------------------

# 1. Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где
# a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).
# Требуется найти N-е число Фибоначчи

# def fib(n):
#     if n == 1 or n == 2:
#         return 1
#     return fib(n-1) + fib(n-2)
#
# number = int(input("Введите число: "))
# i = 1
# fibo = []
# while i <= number:
#     fibo.append(fib(i))
#     i += 1
# print(fibo)

#-------------------------------------------------------------------------------------------------------------------------------------------------
#задача №2
#-------------------------------------------------------------------------------------------------------------------------------------------------

# Хакер Василий получил доступ к классному журналу и хочет заменить все
# свои минимальные оценки на максимальные. Напишите программу, которая
# заменяет оценки Василия, но наоборот: все максимальные – на минимальные.

# from random import randint as RI
#
# number = int(input("Введите количество оценок: "))
# list = list()
# i = 0
# while i < number:
#     list.append(RI(1, 5))
#     i += 1
# print(f'Первый дневник: {list}')
#
# for i in range(0, len(list)):
#     if list[i] > 3:
#         list[i] = 2
# print(f'Измененный дневник: {list}')

#-------------------------------------------------------------------------------------------------------------------------------------------------
#задача №3
#-------------------------------------------------------------------------------------------------------------------------------------------------

# 1. Напишите функцию, которая принимает одно число и проверяет, является ли оно простым
# *Напоминание: Простое число - это число, которое имеет 2 делителя: 1  и n(само число)*

# n = int(input("Введите число: "))
# count = 0
# for num in range(2, n + 1):
#     if n % num == 0:
#         count += 1
# if count == 1:
#     print("Yes")
# else:
#     print("No")

n = int(input("Введите число: "))
def simple(number: int) -> bool:
    if number % 2 == 0 and number != 2:
        return False
    for i in range(3, number, 2):
        if number % i == 0:
            return False
    else:
        return True

if simple(n):
    print("Prostoe")
else:
    print("Ne prosoe")

#-------------------------------------------------------------------------------------------------------------------------------------------------
#задача №4
#-------------------------------------------------------------------------------------------------------------------------------------------------



